# Compatible with pretrained YOLO12s (width_multiple=0.5)
nc: 1
depth_multiple: 0.33
width_multiple: 0.50
anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]
  - [116,90, 156,198, 373,326]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, CBAM, [32]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 1, CoordinateAttention, [64]]
  - [-1, 3, C3, [128]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 1, CBAM, [128]]
  - [-1, 6, C3, [256]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 1, CoordinateAttention, [256]]
  - [-1, 9, C3, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 1, CBAM, [512]]
  - [-1, 3, C3, [1024]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 1, CoordinateAttention, [512]]

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, C3, [512, False]]
  - [-1, 1, CBAM, [256]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 3, C3, [256, False]]
  - [-1, 1, CoordinateAttention, [128]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 19], 1, Concat, [1]]
  - [-1, 3, C3, [512, False]]
  - [-1, 1, CBAM, [256]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, C3, [1024, False]]
  - [-1, 1, CoordinateAttention, [512]]
  - [[22, 26, 31], 1, Detect, [nc]]