# YOLOv11 Crack Segmentation - SAFE FALLBACK VERSION
# Uses C2f instead of C3k2 for maximum compatibility
# All channel counts verified and tested

nc: 1  # number of classes (crack)
depth_multiple: 0.33
width_multiple: 0.50

# Backbone using C2f with edge enhancement
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, EdgeEnhancementModule, [64]]  # 2 - Early edge detection (64ch actual)
  - [-1, 2, C2f, [256, True]]  # 3 → 128 channels
  - [-1, 1, CrackCBAM, [128]]  # 4 - Multi-scale + edge

  - [-1, 1, Conv, [256, 3, 2]]  # 5-P3/8
  - [-1, 2, C2f, [512, True]]  # 6 → 256 channels
  - [-1, 1, CrackCoordinateAttention, [256]]  # 7 - Directional features

  - [-1, 1, Conv, [512, 3, 2]]  # 8-P4/16
  - [-1, 2, C2f, [512, True]]  # 9 → 256 channels

  - [-1, 1, Conv, [1024, 3, 2]]  # 10-P5/32
  - [-1, 2, C2f, [1024, True]]  # 11 → 512 channels
  - [-1, 1, SPPF, [1024, 5]]  # 12 → 512 channels
  - [-1, 1, CrackASPP, [512]]  # 13 - Multi-scale context

# Segmentation head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 9], 1, Concat, [1]]  # 15 cat backbone P4
  - [-1, 2, C2f, [512, False]]  # 16 → 256 channels
  - [-1, 1, EdgeEnhancementModule, [256]]  # 17 - Boundary refinement

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18
  - [[-1, 6], 1, Concat, [1]]  # 19 cat backbone P3
  - [-1, 2, C2f, [256, False]]  # 20 → 128 channels
  - [-1, 1, LightCrackCBAM, [128]]  # 21 - Lightweight attention

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 22
  - [[-1, 3], 1, Concat, [1]]  # 23 cat backbone P2
  - [-1, 2, C2f, [128, False]]  # 24 → 64 channels (P2)
  - [-1, 1, EdgeEnhancementModule, [64]]  # 25 - Final boundary precision

  - [-1, 1, Conv, [128, 3, 2]]  # 26
  - [[-1, 21], 1, Concat, [1]]  # 27 cat
  - [-1, 2, C2f, [256, False]]  # 28 → 128 channels

  - [-1, 1, Conv, [256, 3, 2]]  # 29
  - [[-1, 17], 1, Concat, [1]]  # 30 cat
  - [-1, 2, C2f, [512, False]]  # 31 → 256 channels

  - [-1, 1, Conv, [512, 3, 2]]  # 32
  - [[-1, 13], 1, Concat, [1]]  # 33 cat
  - [-1, 2, C2f, [1024, True]]  # 34 → 512 channels

  - [[25, 28, 31, 34], 1, Segment, [nc, 32, 256]]  # 35 Segment(P2, P3, P4, P5)