# YOLOv12 Segmentation Model with Attention Mechanisms
# yolo12_seg_cbam_ca.yaml - FIXED VERSION

nc: 1  # number of classes (crack)
depth_multiple: 0.33
width_multiple: 0.50

# Define anchors (if needed for older YOLO versions)
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone:
  # P1/2
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, CBAM, [64]]        # 1 - Fixed: use full channel count

  # P2/4
  - [-1, 1, Conv, [128, 3, 2]] # 2-P2/4
  - [-1, 1, CoordinateAttention, [128]] # 3 - Fixed: use full channel count
  - [-1, 3, C3, [128]]         # 4

  # P3/8
  - [-1, 1, Conv, [256, 3, 2]] # 5-P3/8
  - [-1, 1, CBAM, [256]]       # 6 - Fixed: use full channel count
  - [-1, 6, C3, [256]]         # 7

  # P4/16
  - [-1, 1, Conv, [512, 3, 2]] # 8-P4/16
  - [-1, 1, CoordinateAttention, [512]] # 9 - Fixed: use full channel count
  - [-1, 9, C3, [512]]         # 10

  # P5/32
  - [-1, 1, Conv, [1024, 3, 2]] # 11-P5/32
  - [-1, 1, CBAM, [1024]]       # 12 - Fixed: use full channel count
  - [-1, 3, C3, [1024]]         # 13
  - [-1, 1, SPPF, [1024, 5]]    # 14
  - [-1, 1, CoordinateAttention, [1024]] # 15 - Fixed: use full channel count

# YOLOv11/v12 Segmentation Head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 16
  - [[-1, 10], 1, Concat, [1]]  # 17 cat backbone P4
  - [-1, 3, C3, [512, False]]   # 18
  - [-1, 1, CBAM, [512]]        # 19 - Fixed: use full channel count

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 20
  - [[-1, 7], 1, Concat, [1]]   # 21 cat backbone P3
  - [-1, 3, C3, [256, False]]   # 22
  - [-1, 1, CoordinateAttention, [256]] # 23 - Fixed: use full channel count

  - [-1, 1, Conv, [256, 3, 2]]  # 24
  - [[-1, 19], 1, Concat, [1]]  # 25 cat head P4
  - [-1, 3, C3, [512, False]]   # 26
  - [-1, 1, CBAM, [512]]        # 27 - Fixed: use full channel count

  - [-1, 1, Conv, [512, 3, 2]]  # 28
  - [[-1, 15], 1, Concat, [1]]  # 29 cat head P5
  - [-1, 3, C3, [1024, False]]  # 30
  - [-1, 1, CoordinateAttention, [1024]] # 31 - Fixed: use full channel count

  # Standard YOLO Segmentation Head
  - [[23, 27, 31], 1, Segment, [nc, 32]] # 32 Segment head